{
    "metadata": {
      "title": "Comprehensive State-by-State Directory of Greywater Laws and Regulations",
      "lastUpdated": "2024-2025",
      "dataSource": "State and federal regulatory agencies",
      "totalStates": 50,
      "summary": "This comprehensive directory reveals a complex patchwork of greywater regulations across the United States, with approximately 30 states having formal greywater policies while 20 states either prohibit such systems or lack specific regulations. Western and Southwestern states lead in progressive greywater frameworks, driven by water scarcity concerns and conservation goals. Arizona pioneered the tiered permit approach allowing systems under 400 gallons per day without permits, while California permits simple washing machine systems without permits for qualifying installations. Eastern and Midwest states generally maintain more restrictive approaches, with states like Illinois and Indiana effectively prohibiting greywater reuse entirely. The regulatory landscape continues evolving rapidly, with Colorado implementing major changes in 2024-2026 shifting to a statewide opt-out system, and several states developing new frameworks as water conservation becomes increasingly critical for sustainable development."
    },
    "states": {
      "Alabama": {
        "legalStatus": "Regulated",
        "governingCode": "Alabama Admin Code r. 335-6-20",
        "permitThresholdGpd": null,
        "permitRequired": "Case-by-case",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Limited municipal reclaimed water provisions"],
        "keyRestrictions": ["Purple piping required", "Signage in English/Spanish"],
        "recentChanges": null,
        "primaryAgency": "Alabama Department of Environmental Management",
        "agencyContact": "adem.alabama.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.adem.alabama.gov/",
        "regulatoryClassification": "Limited Reclaimed Water Program",
        "summary": "Alabama lacks comprehensive residential greywater regulations, instead operating under limited reclaimed water provisions that primarily address municipal systems. The state's approach focuses on larger-scale water reuse projects rather than individual household greywater systems, requiring purple piping and bilingual signage for any approved systems. Residential greywater applications are evaluated on a case-by-case basis through the Alabama Department of Environmental Management, making the regulatory path unclear for most homeowners seeking water conservation options."
      },
      "Alaska": {
        "legalStatus": "Legal",
        "governingCode": "2018 Uniform Plumbing Code Chapter 16, Alaska Administrative Code Title 8, Chapter 63",
        "permitThresholdGpd": 0,
        "permitRequired": "Yes",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subsurface landscape irrigation for single-family dwellings"],
        "keyRestrictions": ["No kitchen/dishwasher water", "Subsurface distribution only"],
        "recentChanges": "Updated regulations October 1, 2023",
        "primaryAgency": "Alaska Department of Labor and Alaska DEC",
        "agencyContact": "907-269-4925 (Labor), 907-269-7635 (DEC)",
        "agencyPhone": "907-269-4925",
        "governmentWebsite": "https://labor.alaska.gov/lss/forms/Plumbing_Code.pdf",
        "regulatoryClassification": "Comprehensive Regulated",
        "summary": "Alaska maintains a clear regulatory framework for residential greywater systems under the 2018 Uniform Plumbing Code, updated as recently as October 2023. The state permits subsurface greywater irrigation for single-family homes with affordable plumbing permits ranging from $1.50 to $10.00. Systems must exclude kitchen and dishwasher water and use only subsurface distribution methods. Alaska's approach balances environmental protection with practical water conservation needs, particularly important given the state's unique climate and infrastructure challenges in many remote communities."
      },
      "Arizona": {
        "legalStatus": "Legal",
        "governingCode": "Arizona Administrative Code Title 18, Chapter 9, Article 7 (R18-9-701 through R18-9-718)",
        "permitThresholdGpd": 400,
        "permitRequired": "Tiered System",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Landscape irrigation", "Toilet flushing", "Cooling systems"],
        "keyRestrictions": ["No spray irrigation", "Subsurface preferred", "Approved plants only"],
        "recentChanges": "Major updates 2022-2023 streamlining permits",
        "primaryAgency": "Arizona Department of Water Resources",
        "agencyContact": "azwater.gov",
        "agencyPhone": "602-771-8585",
        "governmentWebsite": "https://new.azwater.gov/",
        "regulatoryClassification": "Progressive Tiered Framework",
        "summary": "Arizona leads the nation in progressive greywater legislation with its innovative tiered permit system. Systems under 400 gallons per day require no permits, while larger systems follow streamlined approval processes. The state's comprehensive framework reflects decades of water scarcity management and positions Arizona as a model for other drought-prone regions. Recent regulatory updates in 2022-2023 further simplified the permitting process while maintaining safety standards."
      },
      "Arkansas": {
        "legalStatus": "No Specific Regulations",
        "governingCode": "Arkansas Plumbing Code (general provisions)",
        "permitThresholdGpd": null,
        "permitRequired": "Case-by-case",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": [],
        "keyRestrictions": ["Subject to local interpretation"],
        "recentChanges": null,
        "primaryAgency": "Arkansas Department of Health",
        "agencyContact": "healthy.arkansas.gov",
        "agencyPhone": "501-661-2000",
        "governmentWebsite": "https://www.healthy.arkansas.gov/",
        "regulatoryClassification": "No Policy Framework",
        "summary": "Arkansas lacks specific greywater regulations, leaving residents in regulatory uncertainty. The state defers to general plumbing code provisions and local authority interpretations, creating inconsistent approaches across counties and municipalities. Without clear state-level guidance, most installers and homeowners avoid greywater systems due to compliance uncertainty and potential legal risks."
      },
      "California": {
        "legalStatus": "Legal",
        "governingCode": "California Plumbing Code Chapter 16A",
        "permitThresholdGpd": null,
        "permitRequired": "Varies by System Type",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Landscape irrigation", "Toilet flushing", "Cooling systems"],
        "keyRestrictions": ["No pooling", "Proper filtration required", "Health department approval"],
        "recentChanges": "Simplified laundry-to-landscape rules 2023",
        "primaryAgency": "California Building Standards Commission",
        "agencyContact": "cbsc.dgs.ca.gov",
        "agencyPhone": "916-263-0916",
        "governmentWebsite": "https://www.dgs.ca.gov/BSC",
        "regulatoryClassification": "Comprehensive Progressive Framework",
        "summary": "California operates the nation's most comprehensive greywater framework, permitting both indoor and outdoor uses with streamlined processes for simple systems. The state's leadership in water conservation is reflected in recent regulatory simplifications, particularly for laundry-to-landscape systems that now require minimal permitting. California's approach balances innovation with safety, serving as a model for other water-stressed states."
      }
    }
  }